# DataFrame의 특정 컬럼 값 교체하기

[출처](https://rfriend.tistory.com/265)

df.replace({'col1': old_val}, {'col1': new_val})

In [6]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame({'C1':['a_old', 'b', 'c', 'd', 'e'],
               'C2':[1, 2, 3, 4, 5],
               'C3':[6, 7, 8, 9, np.nan]})
df

      C1  C2   C3
0  a_old   1  6.0
1      b   2  7.0
2      c   3  8.0
3      d   4  9.0
4      e   5  NaN

In [8]:
# C1 컬럼의 'a_old' 값을 'a_new' 값으로 변경
df.replace({'C1':'a_old'}, {'C1':'a_new'})

      C1  C2   C3
0  a_new   1  6.0
1      b   2  7.0
2      c   3  8.0
3      d   4  9.0
4      e   5  NaN

In [9]:
# C3 컬럼의 'NaN' 값을 10으로 변경
df.replace({'C3': np.nan}, {'C3': 10})

      C1  C2    C3
0  a_old   1   6.0
1      b   2   7.0
2      c   3   8.0
3      d   4   9.0
4      e   5  10.0

In [10]:
df

      C1  C2   C3
0  a_old   1  6.0
1      b   2  7.0
2      c   3  8.0
3      d   4  9.0
4      e   5  NaN